{"links":[{"source":"https://flux.carboxi.de/how-you-can-use-this-writing-setup/","verified":true,"verified_date":"2025-12-27T18:52:43+00:00","id":1956935,"private":false,"data":{"author":{"name":"flux","url":"https://flux.carboxi.de","photo":"https://avatars.webmention.io/flux.carboxi.de/6ba7ff080dbbed683db92df73660537ba313a6a4dedefd6bd3476e8bd5c4a2c4.png"},"url":"https://flux.carboxi.de/how-you-can-use-this-writing-setup/","name":"How you can use this Writing Setup","content":"Let's start from the beginning. I made this blog to write stuff daily without giving too much thoughts on it, to see my progress on topics that may be controversial and how I am improving on it. Things that I have a very crude understanding of but still have opinions on.\nI basically have two personas here, one the writer me and another the commenter/explainer me. Hey! that's me! So, judging me entirely by this blog alone will be like judging a kid for making mistakes. Interactions\nBlabbering in the wind just doesn't cut it for a learning process. This might calm me down but it wont give me clarity. I might get clarity by researching things by myself but I want a natural approach. Someone envisioned that communnications in the web can also be decentralized as well as interactive and drafted the concept of webmentions, and that resonated with me. As opposed to communicating via a social media being limited to their visual design, I wanted something that had structure but still can be personalized.\nI decided to make this into a template and not just my personal site because I found out that there aren't many people who use webmentions as a form of communication. And if there are, they aren't someone who would interact to my silly ramblings. Also, this site is heavily inspired by Manu's site because of it's simplicity (I don't credit him enough, this design it so brilliant.), but I added a bunch of complexities to it. Characterstics Built with zola static site generator. Because it is rust, and is easy to install and use than hugo. Simple and uses my hand written CSS [...again! Inspired by Manu's blog.] and no JS. Has tags to categorize posts. Because, why not? Uses webmention.io as the listener for webmentions. webmention.app command line and zola generated RSS feed for sending webmentions. GitHub Pages and GitHub Workflows for hosting and checking the webmentions periodically. A custom style for \"inner voice\" which you can use while writing the post. [_Hi_] becomes Hi.\nThough I like to shit on GitHub for being a monopoly and for being Microsoft, I can't deny the fact that they give free access to workflows and pages.\nThough the default CSS and layout is good, I encourage you to tweak the layouts (/templates) and change the CSS to make it personal to you. Step by Step Instructions\n1. Fork and clone this repo. https://github.com/scientiac/blog.carboxide\n2. Make it yours. Edit config.toml with your information getthing the URLs wrong will result in pages not linking properly and fill everything correctly.\nEmail is necessary for creating and verifying your indieweb account. Edit the /static/CNAME with your domain and replace /static/thumbnail.png with your profile picture. Make sure to install zola on your system and test the site locally using zola serve. Edit the files in /author and /now to write about yourself. If everyting is correct push the changes to the GitHub repo.\nIn the config you can use themes for syntax highlighting from the zola docs.\n3. Give GitHub actions the necessary permission to write to your repo.\nGo to Settings > Actions > General > Workflow permissions and select Read and write permissions.\nRe-run the workflow if it had failed previously.\n4. Run the workflow and then enable the pages.\nAfter the GitHub action successfully runs, go to Settings > Pages > Build and Deployment and select Deploy from a branch on Source and gh-pages & \\root on Branch. Add your domain name to Custom domain if you have one.\n5. Check if the site is published.\nGo to the website and see if everything is working properly. Only if your website is published go to the next step. Verify your h-card on indiewebify.me and see if everything is correct.\n6. Make a webmention.io account.\nGo to webmention.io and put your website URL in there. It will automatically detect your email address. Then, verify your email to log in. Go to settings > API Key and copy it to your clipboard.\n7. Save your API secret on GitHub.\nGo to GitHub Settings > Secrets and variables > Actions > Repository secrets and click on New repository secret.\nAdd WEBMENTION_TOKEN as the Name and the API key you copied as the Secret then click on Add Secret.\n8. Add the proper workflows.\nAfter you have the page working and webmention.io set up. Remove the current workflow.\nThen move the workflows directory from the root to .github. # from the project root rm -rf ./.github/workflows/ mv ./workflows/ ./.github/\nAnd finally push the changes.\n9. Verify that everything is working correctly.\nCheck if all the GitHub actions run successfully and nothing fails. Verify everything in indiewebify.me. It is fine if Syndicated Copies shows an error.\n10. Finally write your posts.\nWrite your posts by making a markdown file in /content with the proper header like in the example /content/one.md.\nIf you use Nix then use direnv to enable the nix shell which automatically installs zola for you. You also get a command called now that you can run to get the properly formatted datetime for the post.\nIf you write a post and try to push to the repo, it might fail because the workflow pulled the webmentions from webmentions.io and merged it to your repo. It is fine to force push to publish the changes. If not, then remember to pull and merge the changes before you push. Sending Webmentions\nIn order to send Webmentions, the content should be formatted accordingly. In general I like to utilize three activities to send Webmentions. It is preferred to only use one activity for one mention. Mention\nOne can mention a site using webmention by simply putting the link to the page being mentioned. The site will get the webmention if it supports it. [I love learning things](https://faulty.carboxi.de/learning/) by faulty. or <a href=\"https://faulty.carboxi.de/learning/\">I love learning things</a> by faulty. Like\nOne can like a post using webmention by formatting the link as follows: I like how faulty talks about learning in <a class=\"u-like-of\" href=\"https://faulty.carboxi.de/learning/\">I love learning things</a>.\nI like how faulty talks about learning in I love learning things. Reply\nOne can reply to a post by formatting the link and the text as follows: <a class=\"u-in-reply-to\" href=\"https://faulty.carboxi.de/learning/\">I love learning things</a> I feel the same about learning. Nice writing faulty! Finally\nI made this to introduce people to webmentions and increase interactions using it. I encourage writing both goofy and serious stuff. And even stupid stuff. And most importantly I incourage people to customize the hell out of this base, changing and tweaking css and html without breaking the indieweb structure.\nHappy writing!","published":"2025-10-29T20:14:52+00:00","published_ts":1761768892},"activity":{"type":"like"},"target":"https://faulty.carboxi.de/learning/"},{"source":"https://scientiac.space/syndications/posse-2025-10-26/","verified":true,"verified_date":"2025-12-27T18:52:59+00:00","id":1949790,"private":false,"data":{"author":{"name":"scientiac","url":"https://scientiac.space","photo":"https://avatars.webmention.io/scientiac.space/c0230defbab3e3d3bc93e2dd1e9b71a6208edde48b170add2ff9ef6fbe1c35ec.png"},"url":"https://scientiac.space/syndications/posse-2025-10-26/","name":"Faulty's Site","content":"<p>I just love when people use webmentions. Cool site <a href=\"https://faulty.carboxi.de/one/\">@faulty</a>.</p>","published":"2025-10-26T00:00:00+00:00","published_ts":1761436800},"activity":{"type":"link"},"target":"https://faulty.carboxi.de/one/"}]}